<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class ServiceUpdatesSeeder extends Seeder
{
    protected $serviceUpdates = array(

        array(

            "dari_title" => "آمار کشاورزی افغانستان",
            "english_title" => 'Afghanistan Farming statistic',
            "pashto_title" => "د افغانستان د کرنې احصایه",
            "english_desc" => 'According to the United Nations, nine out of 10 people in Afghanistan do not have enough food to eat and extreme poverty is near-universal. Agriculture remains the backbone of Afghanistan’s economy. USAID assistance improves food security and nutrition, increases domestic production, relieves economic stress on vulnerable households, and gives farmers the knowledge, training, and tools to sustainably feed their communities. We help increase cultivation and production of crops such as wheat, beans, fruits, and vegetables. We also help make the livestock and dairy sectors more efficient and profitable for farmers by providing resources such as animal feed and seeds.',
            "dari_desc" => 'بر اساس گزارش سازمان ملل، از هر 10 نفر در افغانستان 9 نفر غذای کافی برای خوردن ندارند و فقر شدید تقریباً جهانی است. زراعت همچنان ستون فقرات اقتصاد افغانستان است. کمک های USAID امنیت غذایی و تغذیه را بهبود می بخشد، تولیدات داخلی را افزایش می دهد، استرس اقتصادی را بر خانوارهای آسیب پذیر کاهش می دهد و به کشاورزان دانش، آموزش و ابزارهایی برای تغذیه پایدار جوامع خود می دهد. ما به افزایش کشت و تولید محصولاتی مانند گندم، لوبیا، میوه ها و سبزیجات کمک می کنیم. ما همچنین با ارائه منابعی مانند خوراک دام و بذر به کارآمدتر و سودآورتر کردن بخش دام و لبنیات برای کشاورزان کمک می کنیم.',
            "pashto_desc" => 'د ملګرو ملتونو په وینا، په افغانستان کې له هرو لسو کسانو څخه نهه یې د خوړلو لپاره کافي خواړه نه لري او خورا بې وزلي په ټوله نړۍ کې ده. کرنه د افغانستان د اقتصاد ریښه ده. د USAID مرستې د خوړو خوندیتوب او تغذیه ښه کوي، کورني تولید زیاتوي، په زیان منونکو کورنیو باندې اقتصادي فشار کموي، او بزګرانو ته پوهه، روزنه، او وسایل ورکوي ترڅو په دوامداره توګه خپلو ټولنو ته خواړه ورکړي. موږ د حاصلاتو لکه غنم، لوبیا، میوو او سبزیجاتو د کښت او تولید په زیاتولو کې مرسته کوو. موږ د مالدارۍ او لبنیاتو سکتورونو کې هم مرسته کوو چې د کروندګرو لپاره د سرچینو لکه د څارویو خواړه او تخمونه چمتو کولو سره ډیر اغیزمن او ګټور وي.',
            "service_id" => 7,
            "update_type" => "Farming",
            "publish_date" => "2023-09-25",
            "expire_date" => "2023-10-30"

        ),
        array(

            "dari_title" => "مقامات افغانستان و پاکستان در مورد حل مسائل تجاری دوجانبه در اسلام آباد گفتگو کردند",
            "english_title" => "Afghan, Pakistani officials discuss resolving bilateral trade issues in Islamabad",
            "pashto_title" => "مقامات افغانستان و پاکستان در مورد حل مسائل تجاری دوجانبه در اسلام آباد گفتگو کردند",
            "dari_desc" => "سردار احمد شکیب سفیر افغانستان در پاکستان روز پنجشنبه در دیدار با محمد صالح احمد فاروقی معاون وزیر تجارت پاکستان، مشکلات تجارت و بازرگانی دو کشور را مورد بحث و بررسی قرار داد و بر حل آن تاکید کرد.",
            "english_desc" => "Afghanistan’s ambassador to Pakistan Sardar Ahmad Shakib during a meeting on Thursday with Pakistan’s Deputy Commerce Minister Mohammad Saleh Ahmad Farooqi discussed the problems in trade and commerce between the two countries and stressed the need for its solution, according to a statement on Thursday",
            "pashto_desc" => "په پاکستان کې د افغانستان سفیر سردار احمد شکیب د پنجشنبې په ورځ د پاکستان د سوداګرۍ وزارت له مرستیال محمد صالح احمد فاروقي سره د لیدنې پر مهال د دواړو هېوادونو ترمنځ د سوداګرۍ او صنایعو په برخه کې پر شته ستونزو خبرې وکړې او د حل پر اړتیا یې ټینګار وکړ.",
            "service_id" => 2,
            "update_type" => "gov_news",
            "publish_date" => "2023-09-02",
            "expire_date" => "2023-09-30"

        ),
        array(
            "dari_title" => "هند 47500 متریک تن کمک گندم به افغانستان ارسال کرده است",
            "english_title" => "India has sent record 47,500 metric tons of wheat aid to Afghanistan",
            "pashto_title" => "هند له افغانستان سره ۴۷۵۰۰ مټریک ټنه غنمو مرسته وکړه",
            "dari_desc" => "هند در دو سال گذشته در بحبوحه تشدید بحران انسانی، رکورد 47500 متریک تن گندم به افغانستان ارسال کرده است.",
            "english_desc" => "India has sent a record 47,500 metric tons of wheat to Afghanistan in the past two years amid an escalating humanitarian crisis",
            "pashto_desc" => "هند په تېرو دوو کلونو کې افغانستان ته ۴۷۵۰۰ مټریک ټنه غنم د بشري ناورین د زیاتېدو په ترڅ کې استولي دي.",
            "service_id" => 2,
            "update_type" => "gov_news",
            "publish_date" => "2023-09-02",
            "expire_date" => "2023-09-30"
        ),

        array(
            "dari_title" => "دلاور: 90 درصد عواید معادن پنجشیر برای بازسازی این ولایت مصرف خواهد شد.",
            "english_title" => "Delawar: 90% of Panjshir mining revenues to be used in reconstruction of the province.",
            "pashto_title" => "دلاور: د پنجشیر د کانونو ۹۰ سلنه عواید به د دغه ولایت په بیارغونه ولګول شي.",
            "dari_desc" => "دلاور: 90 درصد عواید معادن پنجشیر برای بازسازی این ولایت مصرف خواهد شد.",
            "english_desc" => "Acting Minister of Mines and Petroleum Shahabuddin Delawar says no fundamental projects 
            have been launched in Afghanistan’s Panjshir province over the last two decades to improve the economic condition of the people of this province
            ",
            "pashto_desc" => "د کانونو او پټرولیم وزارت سرپرست شهاب الدین دلاور وايي، هېڅ بنسټیزه پروژه نه لري
            د افغانستان په پنجشیر ولایت کې په تیرو دوو لسیزو کې د دغه ولایت د خلکو د اقتصادي وضعیت د ښه والي په موخه پیل شوي دي.",
            "service_id" => 2,
            "update_type" => "gov_news",
            "publish_date" => "2023-09-02",
            "expire_date" => "2023-09-30"
        ),
        array(
            "dari_title" => "وقت نماز",
            "english_title" => "Time of Prayer",
            "pashto_title" => "د لمانځه وخت",
            "english_desc" =>'<table class=col-md-12><tr><th>City<th>Morning<th>Dohur<th>Maghreb<th>Shaam<th>Isha<tr><td>Kabul<td>05:30 AM<td>01:00 PM<td>05:00 PM<td>06:00 PM<td>08:30 PM<tr><td>Kandhahar<td>05:30 AM<td>01:00 PM<td>05:00 PM<td>06:00 PM<td>08:30 PM<tr><td>Mazar<td>05:30 AM<td>01:00 PM<td>05:00 PM<td>06:00 PM<td>08:30 PM</table><p>Source: Muslim App',
            "dari_desc" =>'Current date: 2023-09-21<table class=col-md-12><tr><th>شهر<th>صبح<th>پیشین<th>دیگر<th>شام<th>خفتن<tr><td>کابل<td>05:30 ق ظ<td>01:00 ب ظ<td>05:00 ب ظ<td>06:00 ب ظ<td>08:30 ب ظ<tr><td>کندهار<td>05:30 ق ظ<td>01:00 ب ظ<td>05:00 ب ظ<td>06:00 ب ظ<td>08:30 ب ظ<tr><td>مزار<td>05:30 ق ظ<td>01:00 ب ظ<td>05:00 ب ظ<td>06:00 ب ظ<td>08:30 ب ظ</table><p>منبع: Muslim App',
            "pashto_desc" =>'',
            "service_id" => 1,
            "update_type" => "paryer",
            "publish_date" => "2023-09-02",
            "expire_date" => "2023-09-30"
        ),
        
        array(
            "dari_title" => "وقت نماز",
            "english_title" => "Time of Prayer",
            "pashto_title" => "د لمانځه وخت",
            "english_desc" =>'<table class=col-md-12><tr><th>City<th>Morning<th>Dohur<th>Maghreb<th>Shaam<th>Isha<tr><td>Kabul<td>05:30 AM<td>01:00 PM<td>05:00 PM<td>06:00 PM<td>08:30 PM<tr><td>Kandhahar<td>05:30 AM<td>01:00 PM<td>05:00 PM<td>06:00 PM<td>08:30 PM<tr><td>Mazar<td>05:30 AM<td>01:00 PM<td>05:00 PM<td>06:00 PM<td>08:30 PM</table><p>Source: Muslim App',
            "dari_desc" =>'Current date: 2023-09-21<table class=col-md-12><tr><th>شهر<th>صبح<th>پیشین<th>دیگر<th>شام<th>خفتن<tr><td>کابل<td>05:30 ق ظ<td>01:00 ب ظ<td>05:00 ب ظ<td>06:00 ب ظ<td>08:30 ب ظ<tr><td>کندهار<td>05:30 ق ظ<td>01:00 ب ظ<td>05:00 ب ظ<td>06:00 ب ظ<td>08:30 ب ظ<tr><td>مزار<td>05:30 ق ظ<td>01:00 ب ظ<td>05:00 ب ظ<td>06:00 ب ظ<td>08:30 ب ظ</table><p>منبع: Muslim App',
            "pashto_desc" =>'',
            "service_id" => 1,
            "update_type" => "paryer",
            "publish_date" => "2023-09-02",
            "expire_date" => "2023-09-30"
        ),


        array(
            "dari_title" => "آب و هوا",
            "english_title" => "Weather",
            "pashto_title" => "د هوا حالات",
            "english_desc" => '<p>Current date:2023-09-21<table class=col-md-12><tr><th>City<th>High (C)<th>Low (C)<th>Condition<tr><td>Kabul<td>15 C<td>7 C<td>Shower<img src=assets/img/weather/shower.jpeg></table><p>Source: weather.com',
            "pashto_desc" => '',
            "dari_desc" => 'تاریخ<table class=col-md-12><tr><th>شهر<th>بلندترین درجه<th>پاینترین درجه<th>وضعیت<tr><td>کابل<td>15 C<td>7 C<td>بارانی<img src=assets/img/weather/shower.jpeg></table><p>منبع: weather.com', 
            "service_id" => 4,
            "update_type" => "weather",
            "publish_date" => "2023-09-02",
            "expire_date" => "2023-09-30"
        ),
        
        array(
            "dari_title" => "آب و هوا",
            "english_title" => "Weather",
            "pashto_title" => "د هوا حالات",
            "english_desc" => '<p>Current date:2023-09-21<table class=col-md-12><tr><th>City<th>High (C)<th>Low (C)<th>Condition<tr><td>Kabul<td>15 C<td>7 C<td>Shower<img src=assets/img/weather/shower.jpeg></table><p>Source: weather.com',
            "pashto_desc" => '',
            "dari_desc" => 'تاریخ<table class=col-md-12><tr><th>شهر<th>بلندترین درجه<th>پاینترین درجه<th>وضعیت<tr><td>کابل<td>15 C<td>7 C<td>بارانی<img src=assets/img/weather/shower.jpeg></table><p>منبع: weather.com', 
            "service_id" => 4,
            "update_type" => "weather",
            "publish_date" => "2023-09-02",
            "expire_date" => "2023-09-30"
        ),

        array(
            "dari_title" => "نرخ تبادله اسعار",
            "english_title" => "Currency Exchange Rate",
            "pashto_title" => "د اسعارو بیه",
            "english_desc" => '<p>Current date:2023-09-21<table class=col-md-12><tr><th>Currency<th>Buy<th>Sale<tr><td><img src=assets/img/flags/us.jpeg>1 USD to AFN <img src=assets/img/flags/af.jpeg><td>80.10 AFN<td>81.10 AFN<tr><td><img src=assets/img/flags/canada.jpeg>1 CAD to AFN <img src=assets/img/flags/af.jpeg><td>70.10 AFN<td>71.10 AFN<tr><td><img src=assets/img/flags/eur.jpeg>1 EUR to AFN <img src=assets/img/flags/af.jpeg><td>90.10 AFN<td>91.10 AFN<tr><td><img src=assets/img/flags/ir.jpeg>1000 IRP to AFN <img src=assets/img/flags/af.jpeg><td>494.20 AFN<td>498.10 AFN</table><p>Source: Sarai shahzada',
            "pashto_desc" => '',
            "dari_desc" => 'تاریخ:2023-09-21<table class=col-md-12><tr><th>واحد پول<th>خرید<th>فروش<tr><td><img src=assets/img/flags/us.jpeg>1 دالر امریکایی به افغانی <img src=assets/img/flags/af.jpeg><td>80.10 افغانی<td>81.10 افغانی<tr><td><img src=assets/img/flags/canada.jpeg>1 دالر کانادایی به افغانی <img src=assets/img/flags/af.jpeg><td>70.10 افغانی<td>71.10 افغانی<tr><td><img src=assets/img/flags/eur.jpeg>1 یورو به افغانی <img src=assets/img/flags/af.jpeg><td>90.10 افغانی<td>91.10 افغانی<tr><td><img src=assets/img/flags/ir.jpeg>1000 تومان ایرانی به افغانی <img src=assets/img/flags/af.jpeg><td>494.20 افغانی<td>498.10 افغانی</table><p>منبع: Sarai shahzada',
            "service_id" => 3,
            "update_type" => "weather",
            "publish_date" => "2023-09-02",
            "expire_date" => "2023-09-30"
        ),

        array(
            "dari_title" => "نرخ تبادله اسعار",
            "english_title" => "Currency Exchange Rate",
            "pashto_title" => "د اسعارو بیه",
            "english_desc" => '<p>Current date:2023-09-21<table class=col-md-12><tr><th>Currency<th>Buy<th>Sale<tr><td><img src=assets/img/flags/us.jpeg>1 USD to AFN <img src=assets/img/flags/af.jpeg><td>80.10 AFN<td>81.10 AFN<tr><td><img src=assets/img/flags/canada.jpeg>1 CAD to AFN <img src=assets/img/flags/af.jpeg><td>70.10 AFN<td>71.10 AFN<tr><td><img src=assets/img/flags/eur.jpeg>1 EUR to AFN <img src=assets/img/flags/af.jpeg><td>90.10 AFN<td>91.10 AFN<tr><td><img src=assets/img/flags/ir.jpeg>1000 IRP to AFN <img src=assets/img/flags/af.jpeg><td>494.20 AFN<td>498.10 AFN</table><p>Source: Sarai shahzada',
            "pashto_desc" => '',
            "dari_desc" => 'تاریخ:2023-09-21<table class=col-md-12><tr><th>واحد پول<th>خرید<th>فروش<tr><td><img src=assets/img/flags/us.jpeg>1 دالر امریکایی به افغانی <img src=assets/img/flags/af.jpeg><td>80.10 افغانی<td>81.10 افغانی<tr><td><img src=assets/img/flags/canada.jpeg>1 دالر کانادایی به افغانی <img src=assets/img/flags/af.jpeg><td>70.10 افغانی<td>71.10 افغانی<tr><td><img src=assets/img/flags/eur.jpeg>1 یورو به افغانی <img src=assets/img/flags/af.jpeg><td>90.10 افغانی<td>91.10 افغانی<tr><td><img src=assets/img/flags/ir.jpeg>1000 تومان ایرانی به افغانی <img src=assets/img/flags/af.jpeg><td>494.20 افغانی<td>498.10 افغانی</table><p>منبع: Sarai shahzada',
            "service_id" => 3,
            "update_type" => "weather",
            "publish_date" => "2023-09-02",
            "expire_date" => "2023-09-30"
        ),


        array(
            "dari_title" => "کمک های اولیه ",
            "english_title" => "First-hand experience",
            "pashto_title" => "د لومری مرسته",
            "dari_desc" => 'جعبه کمک های اولیه برای یک خانواده چهار نفره شامل موارد زیر است:
            <div class="dari-text"><p>&#1585;&#1575;&#1607;&#1606;&#1605;&#1575;&#1740; &#1705;&#1605;&#1705; &#1607;&#1575;&#1740; &#1575;&#1608;&#1604;&#1740;&#1607;</br>  &#10625; 2 &#1662;&#1575;&#1606;&#1587;&#1605;&#1575;&#1606; &#1601;&#1588;&#1585;&#1583;&#1607; &#1580;&#1575;&#1584;&#1576; (5&times;9 &#1575;&#1740;&#1606;&#1670;)</br>  &#10625; 25 &#1576;&#1575;&#1606;&#1583; &#1670;&#1587;&#1576; (&#1587;&#1575;&#1740;&#1586;&#1607;&#1575;&#1740; &#1605;&#1582;&#1578;&#1604;&#1601;)</br>  &#10625; 1 &#1606;&#1608;&#1575;&#1585; &#1662;&#1575;&#1585;&#1670;&#1607; &#1575;&#1740; &#1670;&#1587;&#1576; (10 &#1740;&#1575;&#1585;&#1583; &#1583;&#1585; 1 &#1575;&#1740;&#1606;&#1670;)</br>  &#10625; 5 &#1576;&#1587;&#1578;&#1607; &#1662;&#1605;&#1575;&#1583; &#1570;&#1606;&#1578;&#1740; &#1576;&#1740;&#1608;&#1578;&#1740;&#1705;</br>  &#10625; 5 &#1576;&#1587;&#1578;&#1607; &#1583;&#1587;&#1578;&#1605;&#1575;&#1604; &#1605;&#1585;&#1591;&#1608;&#1576; &#1590;&#1583; &#1593;&#1601;&#1608;&#1606;&#1740; &#1705;&#1606;&#1606;&#1583;&#1607;</br>  &#10625; 2 &#1576;&#1587;&#1578;&#1607; &#1570;&#1587;&#1662;&#1585;&#1740;&#1606; (&#1607;&#1585; &#1705;&#1583;&#1575;&#1605; 81 &#1605;&#1740;&#1604;&#1740; &#1711;&#1585;&#1605;)</br>  &#10625; 1 &#1593;&#1583;&#1583; &#1662;&#1578;&#1608; &#1575;&#1590;&#1591;&#1585;&#1575;&#1585;&#1740;</br>  &#10625; 1 &#1605;&#1575;&#1606;&#1593; &#1578;&#1606;&#1601;&#1587; (&#1576;&#1575; &#1583;&#1585;&#1740;&#1670;&#1607; &#1740;&#1705; &#1591;&#1585;&#1601;&#1607;)</br>  &#10625; 1 &#1705;&#1605;&#1662;&#1585;&#1587; &#1587;&#1585;&#1583; &#1601;&#1608;&#1585;&#1740;</br>  &#10625; 2 &#1580;&#1601;&#1578; &#1583;&#1587;&#1578;&#1705;&#1588; &#1594;&#1740;&#1585; &#1604;&#1575;&#1578;&#1705;&#1587; (&#1587;&#1575;&#1740;&#1586;: &#1576;&#1586;&#1585;&#1711;)</br>  &#10625; 2 &#1576;&#1587;&#1578;&#1607; &#1662;&#1605;&#1575;&#1583; &#1607;&#1740;&#1583;&#1585;&#1608;&#1705;&#1608;&#1585;&#1578;&#1740;&#1586;&#1608;&#1606;</br>  &#10625; 1 &#1576;&#1575;&#1606;&#1583; &#1711;&#1575;&#1586;&#1740; &#1585;&#1608;&#1604;&#1740; (&#1594;&#1604;&#1578;&#1740;) 3 &#1575;&#1740;&#1606;&#1670;&#1740;</br>  &#10625; 1 &#1576;&#1575;&#1606;&#1583; &#1594;&#1604;&#1578;&#1705;&#1740; (&#1593;&#1585;&#1590; 4 &#1575;&#1740;&#1606;&#1670;)</br>  &#10625; 5 &#1662;&#1583; &#1711;&#1575;&#1586; &#1575;&#1587;&#1578;&#1585;&#1740;&#1604; 3 &#1583;&#1585; 3 &#1575;&#1740;&#1606;&#1670;&#1740;</br>  &#10625; 5 &#1662;&#1583; &#1711;&#1575;&#1586; &#1575;&#1587;&#1578;&#1585;&#1740;&#1604; (4 &times; 4 &#1575;&#1740;&#1606;&#1670;)</br>  &#10625; &#1740;&#1705; &#1583;&#1605;&#1575;&#1587;&#1606;&#1580; (&#1594;&#1740;&#1585; &#1580;&#1740;&#1608;&#1607; &#1575;&#1740;/&#1594;&#1740;&#1585; &#1588;&#1740;&#1588;&#1607; &#1575;&#1740;)</br>  &#10625; 2 &#1593;&#1583;&#1583; &#1576;&#1575;&#1606;&#1583; &#1605;&#1579;&#1604;&#1579;&#1740;</br>  &#10625; &#1605;&#1608;&#1670;&#1740;&#1606;</br></p>',
            "english_desc" => '<div class="english-text"><p>A first-aid kit for a family of four include the following items:  A first-aid guide  &#10625; 2 absorbent compress dressings (5 x 9 inches)</br>  &#10625; 25 adhesive bandages (assorted sizes)</br>  &#10625; 1 adhesive cloth tape (10 yards x 1 inch)</br>  &#10625; 5 antibiotic ointment packets</br>  &#10625; 5 antiseptic wipe packets</br>  &#10625; 2 packets of aspirin (81 mg each)</br>  &#10625; 1 emergency blanket</br>  &#10625; 1 breathing barrier (with one-way valve)</br>  &#10625; 1 instant cold compress</br>  &#10625; 2 pair of nonlatex gloves (size: large)</br>  &#10625; 2 hydrocortisone ointment packets</br>  &#10625; 1 3-inch gauze roll (roller) bandage</br>  &#10625; 1 roller bandage (4 inches wide)</br>  &#10625; 5 3 x 3-inch sterile gauze pads</br>  &#10625; 5 sterile gauze pads (4 x 4 inches)</br>  &#10625; A thermometer (non-mercury/non-glass)</br>  &#10625; 2 triangular bandages</br>  &#10625; Tweezers</br></p>',
            "pashto_desc" => '<div class="dari-text"><p>&#1585;&#1575;&#1607;&#1606;&#1605;&#1575;&#1740; &#1705;&#1605;&#1705; &#1607;&#1575;&#1740; &#1575;&#1608;&#1604;&#1740;&#1607;</br>  &#10625; 2 &#1662;&#1575;&#1606;&#1587;&#1605;&#1575;&#1606; &#1601;&#1588;&#1585;&#1583;&#1607; &#1580;&#1575;&#1584;&#1576; (5&times;9 &#1575;&#1740;&#1606;&#1670;)</br>  &#10625; 25 &#1576;&#1575;&#1606;&#1583; &#1670;&#1587;&#1576; (&#1587;&#1575;&#1740;&#1586;&#1607;&#1575;&#1740; &#1605;&#1582;&#1578;&#1604;&#1601;)</br>  &#10625; 1 &#1606;&#1608;&#1575;&#1585; &#1662;&#1575;&#1585;&#1670;&#1607; &#1575;&#1740; &#1670;&#1587;&#1576; (10 &#1740;&#1575;&#1585;&#1583; &#1583;&#1585; 1 &#1575;&#1740;&#1606;&#1670;)</br>  &#10625; 5 &#1576;&#1587;&#1578;&#1607; &#1662;&#1605;&#1575;&#1583; &#1570;&#1606;&#1578;&#1740; &#1576;&#1740;&#1608;&#1578;&#1740;&#1705;</br>  &#10625; 5 &#1576;&#1587;&#1578;&#1607; &#1583;&#1587;&#1578;&#1605;&#1575;&#1604; &#1605;&#1585;&#1591;&#1608;&#1576; &#1590;&#1583; &#1593;&#1601;&#1608;&#1606;&#1740; &#1705;&#1606;&#1606;&#1583;&#1607;</br>  &#10625; 2 &#1576;&#1587;&#1578;&#1607; &#1570;&#1587;&#1662;&#1585;&#1740;&#1606; (&#1607;&#1585; &#1705;&#1583;&#1575;&#1605; 81 &#1605;&#1740;&#1604;&#1740; &#1711;&#1585;&#1605;)</br>  &#10625; 1 &#1593;&#1583;&#1583; &#1662;&#1578;&#1608; &#1575;&#1590;&#1591;&#1585;&#1575;&#1585;&#1740;</br>  &#10625; 1 &#1605;&#1575;&#1606;&#1593; &#1578;&#1606;&#1601;&#1587; (&#1576;&#1575; &#1583;&#1585;&#1740;&#1670;&#1607; &#1740;&#1705; &#1591;&#1585;&#1601;&#1607;)</br>  &#10625; 1 &#1705;&#1605;&#1662;&#1585;&#1587; &#1587;&#1585;&#1583; &#1601;&#1608;&#1585;&#1740;</br>  &#10625; 2 &#1580;&#1601;&#1578; &#1583;&#1587;&#1578;&#1705;&#1588; &#1594;&#1740;&#1585; &#1604;&#1575;&#1578;&#1705;&#1587; (&#1587;&#1575;&#1740;&#1586;: &#1576;&#1586;&#1585;&#1711;)</br>  &#10625; 2 &#1576;&#1587;&#1578;&#1607; &#1662;&#1605;&#1575;&#1583; &#1607;&#1740;&#1583;&#1585;&#1608;&#1705;&#1608;&#1585;&#1578;&#1740;&#1586;&#1608;&#1606;</br>  &#10625; 1 &#1576;&#1575;&#1606;&#1583; &#1711;&#1575;&#1586;&#1740; &#1585;&#1608;&#1604;&#1740; (&#1594;&#1604;&#1578;&#1740;) 3 &#1575;&#1740;&#1606;&#1670;&#1740;</br>  &#10625; 1 &#1576;&#1575;&#1606;&#1583; &#1594;&#1604;&#1578;&#1705;&#1740; (&#1593;&#1585;&#1590; 4 &#1575;&#1740;&#1606;&#1670;)</br>  &#10625; 5 &#1662;&#1583; &#1711;&#1575;&#1586; &#1575;&#1587;&#1578;&#1585;&#1740;&#1604; 3 &#1583;&#1585; 3 &#1575;&#1740;&#1606;&#1670;&#1740;</br>  &#10625; 5 &#1662;&#1583; &#1711;&#1575;&#1586; &#1575;&#1587;&#1578;&#1585;&#1740;&#1604; (4 &times; 4 &#1575;&#1740;&#1606;&#1670;)</br>  &#10625; &#1740;&#1705; &#1583;&#1605;&#1575;&#1587;&#1606;&#1580; (&#1594;&#1740;&#1585; &#1580;&#1740;&#1608;&#1607; &#1575;&#1740;/&#1594;&#1740;&#1585; &#1588;&#1740;&#1588;&#1607; &#1575;&#1740;)</br>  &#10625; 2 &#1593;&#1583;&#1583; &#1576;&#1575;&#1606;&#1583; &#1605;&#1579;&#1604;&#1579;&#1740;</br>  &#10625; &#1605;&#1608;&#1670;&#1740;&#1606;</br></p>',
            "service_id" => 5,
            "update_type" => "first-aids",
            "publish_date" => "2023-09-02",
            "expire_date" => "2023-09-30"
        ),
        
        //repeat start
        array(
            "dari_title" => "  آب و هوا",
            "english_title" => "  Weather",
            "pashto_title" => "  د هوا حالات",
            "english_desc" => '<p>Current date:2023-09-21<table class=col-md-12><tr><th>City<th>High (C)<th>Low (C)<th>Condition<tr><td>Kabul<td>15 C<td>7 C<td>Shower<img src=assets/img/weather/shower.jpeg></table><p>Source: weather.com',
            "pashto_desc" => '',
            "dari_desc" => 'تاریخ<table class=col-md-12><tr><th>شهر<th>بلندترین درجه<th>پاینترین درجه<th>وضعیت<tr><td>کابل<td>15 C<td>7 C<td>بارانی<img src=assets/img/weather/shower.jpeg></table><p>منبع: weather.com',
            "service_id" => 4,
            "update_type" => "weather",
            "publish_date" => "2023-09-02",
            "expire_date" => "2023-09-30"
        ),

        array(
            "dari_title" => "کمک های  اولیه ",
            "english_title" => "First hand experience",
            "pashto_title" => "د لومری  مرسته",
            "dari_desc" => 'جعبه کمک های اولیه برای یک خانواده چهار نفره شامل موارد زیر است:
            <div class="dari-text"><p>&#1585;&#1575;&#1607;&#1606;&#1605;&#1575;&#1740; &#1705;&#1605;&#1705; &#1607;&#1575;&#1740; &#1575;&#1608;&#1604;&#1740;&#1607;</br>  &#10625; 2 &#1662;&#1575;&#1606;&#1587;&#1605;&#1575;&#1606; &#1601;&#1588;&#1585;&#1583;&#1607; &#1580;&#1575;&#1584;&#1576; (5&times;9 &#1575;&#1740;&#1606;&#1670;)</br>  &#10625; 25 &#1576;&#1575;&#1606;&#1583; &#1670;&#1587;&#1576; (&#1587;&#1575;&#1740;&#1586;&#1607;&#1575;&#1740; &#1605;&#1582;&#1578;&#1604;&#1601;)</br>  &#10625; 1 &#1606;&#1608;&#1575;&#1585; &#1662;&#1575;&#1585;&#1670;&#1607; &#1575;&#1740; &#1670;&#1587;&#1576; (10 &#1740;&#1575;&#1585;&#1583; &#1583;&#1585; 1 &#1575;&#1740;&#1606;&#1670;)</br>  &#10625; 5 &#1576;&#1587;&#1578;&#1607; &#1662;&#1605;&#1575;&#1583; &#1570;&#1606;&#1578;&#1740; &#1576;&#1740;&#1608;&#1578;&#1740;&#1705;</br>  &#10625; 5 &#1576;&#1587;&#1578;&#1607; &#1583;&#1587;&#1578;&#1605;&#1575;&#1604; &#1605;&#1585;&#1591;&#1608;&#1576; &#1590;&#1583; &#1593;&#1601;&#1608;&#1606;&#1740; &#1705;&#1606;&#1606;&#1583;&#1607;</br>  &#10625; 2 &#1576;&#1587;&#1578;&#1607; &#1570;&#1587;&#1662;&#1585;&#1740;&#1606; (&#1607;&#1585; &#1705;&#1583;&#1575;&#1605; 81 &#1605;&#1740;&#1604;&#1740; &#1711;&#1585;&#1605;)</br>  &#10625; 1 &#1593;&#1583;&#1583; &#1662;&#1578;&#1608; &#1575;&#1590;&#1591;&#1585;&#1575;&#1585;&#1740;</br>  &#10625; 1 &#1605;&#1575;&#1606;&#1593; &#1578;&#1606;&#1601;&#1587; (&#1576;&#1575; &#1583;&#1585;&#1740;&#1670;&#1607; &#1740;&#1705; &#1591;&#1585;&#1601;&#1607;)</br>  &#10625; 1 &#1705;&#1605;&#1662;&#1585;&#1587; &#1587;&#1585;&#1583; &#1601;&#1608;&#1585;&#1740;</br>  &#10625; 2 &#1580;&#1601;&#1578; &#1583;&#1587;&#1578;&#1705;&#1588; &#1594;&#1740;&#1585; &#1604;&#1575;&#1578;&#1705;&#1587; (&#1587;&#1575;&#1740;&#1586;: &#1576;&#1586;&#1585;&#1711;)</br>  &#10625; 2 &#1576;&#1587;&#1578;&#1607; &#1662;&#1605;&#1575;&#1583; &#1607;&#1740;&#1583;&#1585;&#1608;&#1705;&#1608;&#1585;&#1578;&#1740;&#1586;&#1608;&#1606;</br>  &#10625; 1 &#1576;&#1575;&#1606;&#1583; &#1711;&#1575;&#1586;&#1740; &#1585;&#1608;&#1604;&#1740; (&#1594;&#1604;&#1578;&#1740;) 3 &#1575;&#1740;&#1606;&#1670;&#1740;</br>  &#10625; 1 &#1576;&#1575;&#1606;&#1583; &#1594;&#1604;&#1578;&#1705;&#1740; (&#1593;&#1585;&#1590; 4 &#1575;&#1740;&#1606;&#1670;)</br>  &#10625; 5 &#1662;&#1583; &#1711;&#1575;&#1586; &#1575;&#1587;&#1578;&#1585;&#1740;&#1604; 3 &#1583;&#1585; 3 &#1575;&#1740;&#1606;&#1670;&#1740;</br>  &#10625; 5 &#1662;&#1583; &#1711;&#1575;&#1586; &#1575;&#1587;&#1578;&#1585;&#1740;&#1604; (4 &times; 4 &#1575;&#1740;&#1606;&#1670;)</br>  &#10625; &#1740;&#1705; &#1583;&#1605;&#1575;&#1587;&#1606;&#1580; (&#1594;&#1740;&#1585; &#1580;&#1740;&#1608;&#1607; &#1575;&#1740;/&#1594;&#1740;&#1585; &#1588;&#1740;&#1588;&#1607; &#1575;&#1740;)</br>  &#10625; 2 &#1593;&#1583;&#1583; &#1576;&#1575;&#1606;&#1583; &#1605;&#1579;&#1604;&#1579;&#1740;</br>  &#10625; &#1605;&#1608;&#1670;&#1740;&#1606;</br></p>',
            "english_desc" => '<div class="english-text"><p>A first-aid kit for a family of four include the following items:  A first-aid guide  &#10625; 2 absorbent compress dressings (5 x 9 inches)</br>  &#10625; 25 adhesive bandages (assorted sizes)</br>  &#10625; 1 adhesive cloth tape (10 yards x 1 inch)</br>  &#10625; 5 antibiotic ointment packets</br>  &#10625; 5 antiseptic wipe packets</br>  &#10625; 2 packets of aspirin (81 mg each)</br>  &#10625; 1 emergency blanket</br>  &#10625; 1 breathing barrier (with one-way valve)</br>  &#10625; 1 instant cold compress</br>  &#10625; 2 pair of nonlatex gloves (size: large)</br>  &#10625; 2 hydrocortisone ointment packets</br>  &#10625; 1 3-inch gauze roll (roller) bandage</br>  &#10625; 1 roller bandage (4 inches wide)</br>  &#10625; 5 3 x 3-inch sterile gauze pads</br>  &#10625; 5 sterile gauze pads (4 x 4 inches)</br>  &#10625; A thermometer (non-mercury/non-glass)</br>  &#10625; 2 triangular bandages</br>  &#10625; Tweezers</br></p>',
            "pashto_desc" => '<div class="dari-text"><p>&#1585;&#1575;&#1607;&#1606;&#1605;&#1575;&#1740; &#1705;&#1605;&#1705; &#1607;&#1575;&#1740; &#1575;&#1608;&#1604;&#1740;&#1607;</br>  &#10625; 2 &#1662;&#1575;&#1606;&#1587;&#1605;&#1575;&#1606; &#1601;&#1588;&#1585;&#1583;&#1607; &#1580;&#1575;&#1584;&#1576; (5&times;9 &#1575;&#1740;&#1606;&#1670;)</br>  &#10625; 25 &#1576;&#1575;&#1606;&#1583; &#1670;&#1587;&#1576; (&#1587;&#1575;&#1740;&#1586;&#1607;&#1575;&#1740; &#1605;&#1582;&#1578;&#1604;&#1601;)</br>  &#10625; 1 &#1606;&#1608;&#1575;&#1585; &#1662;&#1575;&#1585;&#1670;&#1607; &#1575;&#1740; &#1670;&#1587;&#1576; (10 &#1740;&#1575;&#1585;&#1583; &#1583;&#1585; 1 &#1575;&#1740;&#1606;&#1670;)</br>  &#10625; 5 &#1576;&#1587;&#1578;&#1607; &#1662;&#1605;&#1575;&#1583; &#1570;&#1606;&#1578;&#1740; &#1576;&#1740;&#1608;&#1578;&#1740;&#1705;</br>  &#10625; 5 &#1576;&#1587;&#1578;&#1607; &#1583;&#1587;&#1578;&#1605;&#1575;&#1604; &#1605;&#1585;&#1591;&#1608;&#1576; &#1590;&#1583; &#1593;&#1601;&#1608;&#1606;&#1740; &#1705;&#1606;&#1606;&#1583;&#1607;</br>  &#10625; 2 &#1576;&#1587;&#1578;&#1607; &#1570;&#1587;&#1662;&#1585;&#1740;&#1606; (&#1607;&#1585; &#1705;&#1583;&#1575;&#1605; 81 &#1605;&#1740;&#1604;&#1740; &#1711;&#1585;&#1605;)</br>  &#10625; 1 &#1593;&#1583;&#1583; &#1662;&#1578;&#1608; &#1575;&#1590;&#1591;&#1585;&#1575;&#1585;&#1740;</br>  &#10625; 1 &#1605;&#1575;&#1606;&#1593; &#1578;&#1606;&#1601;&#1587; (&#1576;&#1575; &#1583;&#1585;&#1740;&#1670;&#1607; &#1740;&#1705; &#1591;&#1585;&#1601;&#1607;)</br>  &#10625; 1 &#1705;&#1605;&#1662;&#1585;&#1587; &#1587;&#1585;&#1583; &#1601;&#1608;&#1585;&#1740;</br>  &#10625; 2 &#1580;&#1601;&#1578; &#1583;&#1587;&#1578;&#1705;&#1588; &#1594;&#1740;&#1585; &#1604;&#1575;&#1578;&#1705;&#1587; (&#1587;&#1575;&#1740;&#1586;: &#1576;&#1586;&#1585;&#1711;)</br>  &#10625; 2 &#1576;&#1587;&#1578;&#1607; &#1662;&#1605;&#1575;&#1583; &#1607;&#1740;&#1583;&#1585;&#1608;&#1705;&#1608;&#1585;&#1578;&#1740;&#1586;&#1608;&#1606;</br>  &#10625; 1 &#1576;&#1575;&#1606;&#1583; &#1711;&#1575;&#1586;&#1740; &#1585;&#1608;&#1604;&#1740; (&#1594;&#1604;&#1578;&#1740;) 3 &#1575;&#1740;&#1606;&#1670;&#1740;</br>  &#10625; 1 &#1576;&#1575;&#1606;&#1583; &#1594;&#1604;&#1578;&#1705;&#1740; (&#1593;&#1585;&#1590; 4 &#1575;&#1740;&#1606;&#1670;)</br>  &#10625; 5 &#1662;&#1583; &#1711;&#1575;&#1586; &#1575;&#1587;&#1578;&#1585;&#1740;&#1604; 3 &#1583;&#1585; 3 &#1575;&#1740;&#1606;&#1670;&#1740;</br>  &#10625; 5 &#1662;&#1583; &#1711;&#1575;&#1586; &#1575;&#1587;&#1578;&#1585;&#1740;&#1604; (4 &times; 4 &#1575;&#1740;&#1606;&#1670;)</br>  &#10625; &#1740;&#1705; &#1583;&#1605;&#1575;&#1587;&#1606;&#1580; (&#1594;&#1740;&#1585; &#1580;&#1740;&#1608;&#1607; &#1575;&#1740;/&#1594;&#1740;&#1585; &#1588;&#1740;&#1588;&#1607; &#1575;&#1740;)</br>  &#10625; 2 &#1593;&#1583;&#1583; &#1576;&#1575;&#1606;&#1583; &#1605;&#1579;&#1604;&#1579;&#1740;</br>  &#10625; &#1605;&#1608;&#1670;&#1740;&#1606;</br></p>',
            "service_id" => 5,
            "update_type" => "first-aids",
            "publish_date" => "2023-09-02",
            "expire_date" => "2023-09-30"
        ),
        //repeat end

        array(
            "dari_title" => "نقل قول های اسلامی در مورد ایمان",
            "english_title" => "Islamic Quotes on Faith.",
            "pashto_title" => "د ایمان په اړه اسلامی اقتباسات",
            "dari_desc" => "⦁ «هیچ نسبتی میان خدا و هیچ کس نیست مگر با اطاعت از او». [عمر بن خطاب].
            ⦁ ما ذلیل ترین مردم روی زمین بودیم و خداوند ما را به اسلام عزت بخشید. [عمر بن خطاب].
            ⦁ «اگر می خواهید در نمازتان بیشتر به خدا توجه کنید، در خارج از نمازتان بیشتر به او توجه کنید». [یاسمین موهد]
            ⦁ «محبوب ترین کارها نزد خداوند آن است که پیوسته انجام شود، هر چند اندک باشد». [حضرت محمد ص، صحیح بخاری].
            ⦁ «هنگامی که نماز به عادت تبدیل شود، موفقیت تبدیل به سبک زندگی می شود». ناشناس
            ⦁ «به راستی که من نزدیکم». | [قرآن 2:186]
            ⦁ «هر چه بیشتر قرآن بخوانی بیشتر عاشق مؤلف می‌شوی». [ناشناس].
            ⦁ «خداوند میان آدمی و قلب او قرار می گیرد». [⦁ قرآن 8:24]
            ⦁ «آخرین باری که قرآن خواندی کی بود؟ اگر می‌خواهی تغییر کنی، از کتاب خدا شروع کن.» [ناشناس].
            ⦁ «به سوی خدا بازگردید تا رحمت او را شفابخش هر درد دل و جان خواهی یافت. خداوند تو را هدایت می کند و چشمانت را روشن می کند و دلت را نرم و روحت را استوار می کند. الله عزواجل منبع قوت شماست، خداوند راه حل شما برای هر سختی و مشکلی است. با توکل واقعی بر خدا توکل کن و راههایت را به او بسپار.» [بازگشت به فاطمه].",
            "english_desc" => "
                ⦁	“There is no relationship between Allah and anyone except through obedience to Him.” [Umar Ibn Al Khattab].
                ⦁	“We were the most humiliated people on earth & Allah gave us honour through Islam.” [Umar Ibn Al Khattab].
                ⦁	“If you want to focus more on Allah in your prayers, focus more on Him outside your prayers.” [Yasmin Mogahed]
                ⦁	“The most beloved actions to Allah are those performed consistently, even if they are few.” [Prophet Muhammad PBUH, Sahih Bukhari].
                ⦁	“Once prayer becomes a habit, success becomes a lifestyle.” Anonymous
                ⦁	“Indeed, I am near.” | [Quran 2:186]
                ⦁	“The more you read The Quran the more you’ll fall in love with The Author.” [Anonymous].
                ⦁	“Allah comes in between a person and his heart.” [⦁	Quran 8:24] 
                ⦁	“When was the last time you read the Quran? If you want to change, start with the book of Allah.” [Anonymous].
                ⦁	“Turn to Allah and you will find His Mercy heal every aching part of your heart and soul. Allah will guide you, He will bring clarity to your eyes, make soft your heart and make firm your soul. Allah Azzawajal is your source of strength, Allah SWT is your solution to every hardship and problem. Rely on Allah with true tawwakul and let Him alone guide your ways.” [RevertFatimah].
            ",
            "pashto_desc" => '
                ⦁ د الله او هیچا ترمنځ اړیکه نشته مګر د هغه له اطاعت څخه. [عمر ابن الخطاب]
                ⦁ موږ په ځمکه کې تر ټولو ذلیل خلک وو او الله تعالی موږ ته د اسلام له لارې عزت راکړ. [عمر ابن الخطاب]
                ⦁ که غواړې چې په لمانځه کې پر الله ډېر تمرکز وکړې، نو له لمانځه بهر هم پر الله ډېر تمرکز وکړه. [یاسمین مژده]
                ⦁ "د الله تعالی په نزد تر ټولو محبوب عمل هغه دی چې په دوامداره توګه ترسره شي، که څه هم لږ وي." [پیغمبر صلی الله علیه وسلم، صحیح بخاری].
                ⦁ "کله چې لمونځ عادت شي، بریالیتوب د ژوند طرز بدلیږي." بې نومه
                ⦁ "په حقیقت کې، زه نږدې یم." | [قران 2:186]
                ⦁ "هرڅومره چې تاسو قرآن لولئ هغومره به تاسو د لیکوال سره مینه وکړئ." [بې نومه].
                ⦁ "الله تعالی د انسان او زړه په منځ کې راځي." [قرآن ۸:۲۴]
                ⦁ "تاسو وروستی ځل قرآن کله لولی؟ که بدلون غواړې نو د الله له کتاب څخه پیل کړه. [بې نومه].
                ⦁ "الله ته وګرځئ او تاسو به د هغه رحمت ستاسو د زړه او روح هرې برخې ته شفا درکړي. الله به تاسو ته هدایت وکړي، هغه به ستاسو سترګو ته روښانه کړي، ستاسو زړه نرم کړي او ستاسو روح ټینګ کړي. الله عزوجل ستاسو د قوت سرچینه ده، الله سبحانه وتعالی ستاسو د هر مشکل او مشکل حل دی. په رښتیني توکل سره پر الله توکل وکړئ او یوازې هغه ستاسو د لارې لارښوونه وکړي. [د فاطمې راوګرځول].
            ',
            "service_id" => 6,
            "update_type" => "gov_news",
            "publish_date" => "2023-09-02",
            "expire_date" => "2023-09-30"
        ),


    );
    public function run()
    {
        foreach ($this->serviceUpdates as $update) :
            $updateRecord = \App\Models\ServiceUpdate::where(['dari_title' => $update['dari_title'], 'english_title' => $update['english_title'], 'pashto_title' => $update['pashto_title']])->first();
            DB::table('service_updates')->insert($update);
            if (!$updateRecord) :
            endif;
        endforeach;
    }
}
